Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПеремещениеТоваров</Name>
			<Comment>Перемещение товаров между складами</Comment>
			<BasedOn>
				<xr:Item>Document.ПоступлениеТоваровИУслуг</xr:Item>
				<xr:Item>Document.Монтаж</xr:Item>
				<xr:Item>Document.ПеремещениеТоваров</xr:Item>
				<xr:Item>Document.ЗаказПокупателя</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ТоварыПроизводстваВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеВПути</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ПотребностьВМатериалахДляМонтажа</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВПутиНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезервеНаСкладах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправлено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПолучено</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСобрано</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Монтаж</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровИУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтправленоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолученоОтветственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданПриИспользованииСтатусовПеремещений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ТаблицаНазначения</Name>
					<Comment>Дополнительная аналитика для автоматических документов на основании монтажей</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеремещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыПеремещений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерияНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтправитель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯчейкаПолучатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заказ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЗаказНаПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТаблицаНазначения</Name>
							<Comment>Дополнительная аналитика для автоматических документов на основании монтажей</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ИсторияПеремещенийТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПеремещенийТоваров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Перемещение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИДЗаписи</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыНаСкладах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыПеремещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПеремещений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Заявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Собран</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыДокументовПроверкиКратности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыДокументовПроверкиКратности</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияТоваровИУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РеализацияКлиенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредварительныйРасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеТоваровИУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОприходованиеТоваров</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПеремещениеТоваров/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		//#16858
		ДобавитьЗаписьВИсторию("Создано новое перемещение");
	Иначе
		//#16858
		ПолучитьЗаписиИсторииМонтажаИзРегистраНаСервере();
		Если НЕ ТолькоПросмотр Тогда  // могло отработать ДатыЗапретаИзменения
			ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
		КонецЕсли;
	КонецЕсли;
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	ПраваПользователей.УстановитьТолькоПросмотрДляРеквизитаНомер(Элементы.Номер.ТолькоПросмотр);

	УправлениеФормой();
	
	Элементы.ТоварыЗаполнитьКоличествоПоПотолкам.Видимость = ПолучитьФункциональнуюОпцию("КоличествоТоваровКСписаниюВРозницеНеСоответствуетКоличествуПроданногоТовара") 
															И ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Монтаж");
															
	// Видимость колонки Артикул
	ОбщийМодульСервер.УстановитьВидимостьКолонкиАртикулВТабличнойЧасти(ЭтаФорма);
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ЗаполнитьОстаткиПоТоварам(); // №11476
	
	// оставлять в конце (после добавдения элементов формы (программно))
	Если Параметры.Ключ.Пустая() Тогда
		ПроверитьТолькоРедактированиеСтатуса(Отказ);
	КонецЕсли; 
	
	//nva+++
	ПредыдущийСтатус = Объект.ТекущийСтатус;
	
	Если НЕ Параметры.Ключ.Пустая() И Объект.ТекущийСтатус = Перечисления.СтатусыПеремещений.Отменен Тогда
		ЭтаФорма.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	ИспользоватьКонтрольКратности = ПолучитьФункциональнуюОпцию("ИспользоватьКонтрольКратностиЕдиницИзмерения");
	
	Если Параметры.Ключ.Пустая() Тогда 
		Если ЗначениеЗаполнено(ПараметрыСеанса.Пользователь) Тогда
			Пользователь = ПараметрыСеанса.Пользователь;
			Если ЗначениеЗаполнено(Пользователь.ПеремещениеСкладОтправитель) Тогда
				Объект.СкладОтправитель = Пользователь.ПеремещениеСкладОтправитель;
			КонецЕсли;
			Если ЗначениеЗаполнено(Пользователь.ПеремещениеСкладПолучатель) Тогда
				Объект.СкладПолучатель = Пользователь.ПеремещениеСкладПолучатель;
			КонецЕсли;
			Если ЗначениеЗаполнено(Пользователь.ПеремещениеСтатус) Тогда
				Объект.ТекущийСтатус = Пользователь.ПеремещениеСтатус;
			КонецЕсли;
		КонецЕсли;	
	КонецЕсли;	
	//nva---
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ПроверитьТолькоРедактированиеСтатуса(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если ТипЗнч(Объект.Назначение) = Тип("ДокументСсылка.Монтаж") И НЕ Объект.Назначение.Пустая() Тогда
		Если Объект.ВидОперации.Пустая() Тогда
			ПоказатьПредупреждение(,"Необходимо указать вид операции");
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда		
		Отказ = НЕ ПраваПользователей.РазрешеноПриходоватьНаСклад(Объект.СкладПолучатель);
		Если Отказ Тогда
			Сообщить("У текущего пользователя нет прав для оформления прихода на склад """ + Объект.СкладПолучатель + """");
			Возврат;
		КонецЕсли;
		Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
			Отказ = НЕ ПраваПользователей.РазрешеноРасходоватьСоСклада(Объект.СкладОтправитель);
			Если Отказ Тогда
				Сообщить("У текущего пользователя нет прав для оформления расхода по складу""" + Объект.СкладОтправитель + """");
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписатьИсториюНаФормеВРегистр();
	ПолучитьЗаписиИсторииМонтажаИзРегистраНаСервере();
	
	Элементы.ПодменюПечать.Доступность = ПраваПользователей.ДоступностьПечати(Объект.Ссылка);
	
	Если Объект.Проведен Тогда
		ЭтаФорма.ИспользоватьРежимПроведения=ИспользованиеРежимаПроведения.Неоперативный;
	КонецЕсли;	
	
	ЗаполнитьОстаткиПоТоварам(); // №11476
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если Объект.ВидПеремещения = ПредопределенноеЗначение("Справочник.ВидыПеремещений.ПеремещениеГотовойПродукции") Тогда
		Оповестить("ОбновитьАРМПроизводства",,"ПеремещениеТоваров");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Назначение) И ТипЗнч(Объект.Назначение) = Тип("ДокументСсылка.Монтаж") Тогда		
		Оповестить("ОбновитьПотребностьПоМонтажу", Объект.Назначение, Объект.Ссылка);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "ОбщаяФорма.ФормаПодбораНоменклатуры" Тогда	
		ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

//nva+++
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(Отказ, Объект, Перечисления.ВидыДокументовПроверкиКратности.ПеремещениеТоваров);
	КонецЕсли;
	
КонецПроцедуры
//nva---
#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ПолученоПриИзменении(Элемент)
	ПолученоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолученоПриИзмененииНаСервере()
	
	Если Объект.Получено Тогда
		Объект.ПолученоДата = ТекущаяДатаСеанса();
		Объект.ПолученоОтветственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтправленоПриИзменении(Элемент)
	ОтправленоПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправленоПриИзмененииНаСервере()
	
	Если Объект.Отправлено Тогда
		Объект.ОтправленоДата = ТекущаяДатаСеанса();
		Объект.ОтправленоОтветственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МонтажПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

&НаКлиенте
Процедура ВидПеремещенияПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьНовуюЗаписьВИсторию(Команда)
	
	Если НЕ ПустаяСтрока(НоваяЗаписьВИсторию) Тогда
		ДобавитьЗаписьВИсторию(НоваяЗаписьВИсторию);
		НоваяЗаписьВИсторию = "";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПроверитьТолькоРедактированиеСтатуса(Отказ)
	
	Если ТолькоПросмотр Тогда
		Возврат;
	КонецЕсли;
	
	Если РольДоступна("ДокументПеремещениеТоваровРедактированиеСтатуса")
		И НЕ РольДоступна("ДокументПеремещениеТоваровРедактирование") Тогда
		
		Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Для каждого Элемент из Элементы Цикл			
			Если Элемент.Имя = "ТекущийСтатус" 
				ИЛИ Элемент.Имя = "ФормаЗаписать"
				ИЛИ СтрНайти(Элемент.Имя, "ПодменюПечать") > 1 Тогда
				Продолжить;
			КонецЕсли;
			Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Элемент, "ПодчиненныеЭлементы") Тогда
				Продолжить;
			КонецЕсли;
			Если ТипЗнч(Элемент) = Тип("ДекорацияФормы") Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяСвойства = "ТолькоПросмотр";
			ЗначениеСвойства = Истина;
			Если ТипЗнч(Элемент) = Тип("КнопкаФормы") ИЛИ ТипЗнч(Элемент) = Тип("ДополнениеЭлементаФормы") Тогда
				ИмяСвойства = "Доступность";
				ЗначениеСвойства = Ложь;	
			КонецЕсли;
			Элемент[ИмяСвойства] = ЗначениеСвойства;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УправлениеФормой()
	
	//Если ТипЗнч(Объект.Основание) = Тип("ДокументСсылка.Монтаж") Тогда
	Если Объект.ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеНаСкладМонтажнойБригады Тогда
		Элементы.ВидОперации.Видимость = Истина;
		Элементы.ТоварыТаблицаНазначения.Видимость = Истина;
	Иначе
		Элементы.ВидОперации.Видимость = Ложь;
		Элементы.ТоварыТаблицаНазначения.Видимость = Ложь;
	КонецЕсли;
	
	//#16858
	Элементы.ТекущийСтатус.Видимость = Объект.СозданПриИспользованииСтатусовПеремещений;
	Элементы.ГруппаДатыСтатуса.Видимость = Объект.СозданПриИспользованииСтатусовПеремещений;
	Элементы.ГруппаОтправка.Видимость = НЕ Объект.СозданПриИспользованииСтатусовПеремещений;
	Элементы.ГруппаПолучение.Видимость = НЕ Объект.СозданПриИспользованииСтатусовПеремещений;	
	
	Элементы.ДекорацияОтступЛево.Видимость  = Элементы.ВидОперации.Видимость И Элементы.ТекущийСтатус.Видимость; // когда одновременно есть 2 поля
	Элементы.ДекорацияОтступПраво.Видимость = НЕ Элементы.ВидОперации.Видимость И НЕ Элементы.ТекущийСтатус.Видимость; // когда одновременно нет 2 полей
	
	Элементы.ТоварыЗаказ.Видимость = Объект.ВидПеремещения = Справочники.ВидыПеремещений.ПеремещениеГотовойПродукции;
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьЗаписиИсторииМонтажаИзРегистраНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеРегистра.Дата КАК Дата,
	|	ДанныеРегистра.Пользователь КАК Пользователь,
	|	ДанныеРегистра.Комментарий КАК Комментарий,
	|	ЛОЖЬ КАК ЭтоНоваяЗапись,
	|	ДанныеРегистра.ИДЗаписи КАК ИДЗаписи
	|ИЗ
	|	РегистрСведений.ИсторияПеремещенийТоваров КАК ДанныеРегистра
	|ГДЕ
	|	ДанныеРегистра.Перемещение = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("ИДЗаписи", Выборка.ИДЗаписи);
		Отбор.Вставить("Дата", Выборка.Дата);
		НайденныеСтроки = ИсторияПеремещенияНаФорме.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() = 0 Тогда
			СтрокаЗаписи = ИсторияПеремещенияНаФорме.Добавить();
		Иначе
			СтрокаЗаписи = НайденныеСтроки[0];
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(СтрокаЗаписи, Выборка);
	КонецЦикла;
	
	ИсторияПеремещенияНаФорме.Сортировать("Дата Возр");
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписьВИсторию(Комментарий)
	
	НоваяСтрока = ИсторияПеремещенияНаФорме.Добавить();
	НоваяСтрока.Дата = ТекущаяДатаСеанса();
	НоваяСтрока.Пользователь = Пользователи.ТекущийПользователь();
	НоваяСтрока.Комментарий = Комментарий;
	НоваяСтрока.ЭтоНоваяЗапись = Истина;
	НоваяСтрока.ИДЗаписи = Новый УникальныйИдентификатор;
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИсториюНаФормеВРегистр()
	
	Для Каждого ТекущаяСтрока Из ИсторияПеремещенияНаФорме Цикл
		Если ТекущаяСтрока.ЭтоНоваяЗапись Тогда
			РегистрыСведений.ИсторияПеремещенийТоваров.ДобавитьЗапись(Объект.Ссылка, ТекущаяСтрока.Дата, ТекущаяСтрока.Пользователь, ТекущаяСтрока.Комментарий, ТекущаяСтрока.ИДЗаписи);		 
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

&НаСервереБезКонтекста
Функция ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(Знач Номенклатура)
	Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	//СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	//Если ТипЗнч(СтрокаТабличнойЧасти.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
	//	СтрокаТабличнойЧасти.Коэффициент = 1;
	//Иначе
	//	СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	//КонецЕсли; 
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда 
		Возврат 
	КонецЕсли;
	
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Коэффициент, Количество"); 
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если СтрокаТабличнойЧасти = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//СтрокаТабличнойЧасти.ЕдиницаИзмерения = ПолучитьБазовуюЕдиницуИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	//СтрокаТабличнойЧасти.Коэффициент = 1;
	ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьКоэффициентЕдиницуИзмерения(СтрокаТабличнойЧасти);
	ОбработкаТабличныхЧастейКлиентСервер.ЗаполнитьКоличествоПоПризнакуПотолка(СтрокаТабличнойЧасти); // #7380 
	
	//nva+++
	СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
	СтруктураДанные = ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные);
	
	ЗаполнитьЗначенияСвойств(СтрокаТабличнойЧасти, СтруктураДанные, "Количество");
	
	СтрокаТабличнойЧасти.ЯчейкаОтправитель = ПолучитьЯчейку(СтрокаТабличнойЧасти.Номенклатура, Объект.СкладОтправитель);
	СтрокаТабличнойЧасти.ЯчейкаПолучатель = ПолучитьЯчейку(СтрокаТабличнойЧасти.Номенклатура, Объект.СкладПолучатель);
	//nva---
	
	ЗаполнитьОстаткиПоТоварам(); // №11476
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	СписокЕдиниц = ОбщийМодуль.ПолучитьСписокЕдиницИзмеренияНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	Для Ном = 0 По СписокЕдиниц.Количество() - 1 Цикл
		ДанныеВыбора.Добавить(СписокЕдиниц[Ном]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтрокаТабличнойЧасти.Коэффициент = 1;
	Иначе
		СтрокаТабличнойЧасти.Коэффициент = ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(ВыбранноеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокВидовНоменклатурыТовары()
	
	Возврат Справочники.Номенклатура.ПолучитьСписокВидовНоменклатурыТовары();
	
КонецФункции

&НаКлиенте
Процедура ПодобратьТовары(Команда)
	
	ПараметрыПодбора = Новый Структура;
	ПараметрыПодбора.Вставить("Дата",					Объект.Дата);
	ПараметрыПодбора.Вставить("Организация",			Объект.Организация);
	ПараметрыПодбора.Вставить("Склад",					Объект.СкладОтправитель);
	ПараметрыПодбора.Вставить("ВидНоменклатуры",		ПолучитьСписокВидовНоменклатурыТовары());
	
	//nva+++
	Если ИспользоватьКонтрольКратности Тогда
		ПараметрыПодбора.Вставить("ВидДокументаПроверкиКратности",ПредопределенноеЗначение("Перечисление.ВидыДокументовПроверкиКратности.ПеремещениеТоваров")); //#2792
	КонецЕсли;
	//nva---
	
	ОткрытьФорму("ОбщаяФорма.ФормаПодбораНоменклатуры", ПараметрыПодбора, ЭтаФорма, УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбораПодборНаКлиенте(ВыбранноеЗначение)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
			
	ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение);
		
КонецПроцедуры

&НаСервере
Функция ОбработкаВыбораПодборНаСервере(ВыбранноеЗначение)
	
	ТаблицаТоваров = ПолучитьИзВременногоХранилища(ВыбранноеЗначение.АдресВХранилище);
	
	Для Каждого ТекущаяСтрока из ТаблицаТоваров Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
		НоваяСтрока.ЯчейкаОтправитель = ПолучитьЯчейку(НоваяСтрока.Номенклатура, Объект.СкладОтправитель);
		НоваяСтрока.ЯчейкаПолучатель = ПолучитьЯчейку(НоваяСтрока.Номенклатура, Объект.СкладПолучатель);
	КонецЦикла;
	
	ЗаполнитьОстаткиПоТоварам(); // №11476
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПоОстаткамНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	
	Запрос.УстановитьПараметр("Склад", Объект.СкладОтправитель); 
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("Нет остатков на складе");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Коэффициент = 1;
	КонецЦикла;
	
	ЗаполнитьОстаткиПоТоварам(); // №11476
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоОстаткам(Команда)
	
	Если объект.СкладОтправитель.Пустая() Тогда 
		ПоказатьПредупреждение(,"Не выбран склад Отправитель");
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда 
		ОП = Новый ОписаниеОповещения ("ДействиеПослеОтветаНаЗапросОбОчисткеТаблицыТовары", ЭтотОбъект, "ПоОстатку");
		ПоказатьВопрос(ОП,"Таблица товаров непустая и будет очищена.
				|Продолжить?",РежимДиалогаВопрос.ОКОтмена);
	Иначе
		ЗаполнитьПоОстаткамНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДействиеПослеОтветаНаЗапросОбОчисткеТаблицыТовары(Результат, Допы) Экспорт
	
	Если Результат = КодВозвратаДиалога.ОК Тогда 
		Объект.Товары.Очистить();
		Если Допы = "ПоОстатку" Тогда 
			ЗаполнитьПоОстаткамНаСервере();
		ИначеЕсли Допы = "ВидНоменклатуры" Тогда 
			ПоказатьОкноВыбораОкнаВидаНоменклатуры();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоВидуНоменклатуры(Команда)	
	
	Если Объект.СкладОтправитель.Пустая() Тогда 
		ПоказатьПредупреждение(,"Не выбран склад Отправитель");
		Возврат;
	КонецЕсли;
	
	Если Объект.Товары.Количество() > 0 Тогда 
		ОП = Новый ОписаниеОповещения ("ДействиеПослеОтветаНаЗапросОбОчисткеТаблицыТовары", ЭтотОбъект, "ВидНоменклатуры");
		ПоказатьВопрос(ОП,"Таблица товаров непустая и будет очищена.
				|Продолжить?",РежимДиалогаВопрос.ОКОтмена);
	Иначе	
		ПоказатьОкноВыбораОкнаВидаНоменклатуры();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОкноВыбораОкнаВидаНоменклатуры()
	
	ВидНоменклатуры = ЗначениеСправочникаВидовНоменклатуры();
	ПоказатьВводЗначения(новый ОписаниеОповещения("ПослеВыбораВидаНоменклатуры",ЭтаФорма),ВидНоменклатуры);

КонецПроцедуры

&НаСервере
Функция ЗначениеСправочникаВидовНоменклатуры()
	Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();
КонецФункции

&НаСервере
Процедура ПослеВыбораВидаНоменклатуры(ВыбЗнач, Параметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТоварыНаСкладахОстатки.Номенклатура,
	|	ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры,
	|	ТоварыНаСкладахОстатки.СерияНоменклатуры,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество,
	|	ТоварыНаСкладахОстатки.Номенклатура.БазоваяЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Склад = &Склад) КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Номенклатура.ВидНоменклатуры = &ВидНоменклатуры";
	
	Запрос.УстановитьПараметр("Склад", Объект.СкладОтправитель); 
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВыбЗнач);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("Нет остатков на складе");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		НоваяСтрока.Коэффициент = 1;
	КонецЦикла;
	
	ЗаполнитьОстаткиПоТоварам(); // №11476

КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьКоличествоПоПотолкам(Команда)
	
	Если Объект.Товары.Количество() > 0 Тогда 
		ОписаниеОповещения = Новый ОписаниеОповещения ("ПослеВопросаЗаполнитьКоличествоПоПотолкам", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Для потолков колонка ""Количество"" будет заполнена значением площади из карточки потолка.
				|Продолжить?",РежимДиалогаВопрос.ДаНет);
	Иначе
		Сообщить("Табличная часть ""Товары"" пустая");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаЗаполнитьКоличествоПоПотолкам(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда 
		Возврат;
	КонецЕсли;
	ЗаполнитьКоличествоПоПотолкамНаСервере();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьКоличествоПоПотолкамНаСервере()
	
	Для каждого СтрокаТабличнойЧасти из объект.Товары Цикл
		Если Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(СтрокаТабличнойЧасти.Номенклатура) Тогда
			Если СтрокаТабличнойЧасти.Номенклатура.Потолок_КоличествоПродукция > 0 
				И СтрокаТабличнойЧасти.Количество <> СтрокаТабличнойЧасти.Номенклатура.Потолок_КоличествоПродукция Тогда
				СтрокаТабличнойЧасти.Количество = СтрокаТабличнойЧасти.Номенклатура.Потолок_КоличествоПродукция;
				Модифицированность = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

//++ №11476
&НаСервере
Процедура ЗаполнитьОстаткиПоТоварам()
	
	ДатаОстатков = ?(НЕ Объект.Ссылка.Пустая(), Объект.Дата, ТекущаяДатаСеанса());
	ЗапасыСервер.ЗаполнитьОстаткиПоТоварамВТЧ(Объект.Товары, Объект.Организация, Объект.СкладОтправитель, ДатаОстатков, Объект.Основание);

	//РезультатЗапроса = ПолучитьОстаткиПоПозициям(Объект.Товары.Выгрузить());
	//
	//Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
	//	
	//	Отбор = Новый Структура;
	//	Отбор.Вставить("Номенклатура", ТекущаяСтрока.Номенклатура);
	//	Отбор.Вставить("ХарактеристикаНоменклатуры", ТекущаяСтрока.ХарактеристикаНоменклатуры);
	//	Отбор.Вставить("СерияНоменклатуры", ТекущаяСтрока.СерияНоменклатуры);
	//	
	//	НайденныеСтроки = РезультатЗапроса.НайтиСтроки(Отбор);
	//	
	//	Если НайденныеСтроки.Количество() > 0 Тогда
	//		
	//		ТекущаяСтрока.ОстатокНаСкладе = НайденныеСтроки[0].ОстатокНаСкладе;
	//		ТекущаяСтрока.ВРезерве = НайденныеСтроки[0].КоличествоВРезерве;
	//		ТекущаяСтрока.Доступно = ТекущаяСтрока.ОстатокНаСкладе - ТекущаяСтрока.ВРезерве;
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	
КонецПроцедуры

//&НаСервере
//Функция ПолучитьОстаткиПоПозициям(ТаблицаПозиций)
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = ТекстЗапросаОстатков();
//	
//	Запрос.УстановитьПараметр("ТаблицаДокумента",	ТаблицаПозиций);
//	Запрос.УстановитьПараметр("Организация",		Объект.Организация);
//	Запрос.УстановитьПараметр("Склад",				Объект.СкладОтправитель);
//	Запрос.УстановитьПараметр("ИспользуютсяОбщиеСклады", 	Константы.ОбщиеСклады.Получить());
//	Запрос.УстановитьПараметр("ИспользоватьРезервирование", ПолучитьФункциональнуюОпцию("ИспользоватьРезервирование"));
//	
//	Возврат Запрос.Выполнить().Выгрузить();
//	
//КонецФункции

//&НаСервереБезКонтекста
//Функция ТекстЗапросаОстатков()
//	
//	ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ТЗ_ТаблицаДокумента.Номенклатура,
//	|	ТЗ_ТаблицаДокумента.ХарактеристикаНоменклатуры,
//	|	ТЗ_ТаблицаДокумента.СерияНоменклатуры,
//	|	ТЗ_ТаблицаДокумента.Количество,
//	|	ТЗ_ТаблицаДокумента.Коэффициент
//	|ПОМЕСТИТЬ ВремТаблицаДокумента
//	|ИЗ
//	|	&ТаблицаДокумента КАК ТЗ_ТаблицаДокумента
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
//	|	ВремТаблицаДокумента.Номенклатура,
//	|	ВремТаблицаДокумента.ХарактеристикаНоменклатуры,
//	|	ВремТаблицаДокумента.СерияНоменклатуры,
//	|	ВЫБОР
//	|		КОГДА ВремТаблицаДокумента.Коэффициент <> 0
//	|			ТОГДА ТоварыНаСкладахОстатки.КоличествоОстаток / ВремТаблицаДокумента.Коэффициент
//	|		ИНАЧЕ ТоварыНаСкладахОстатки.КоличествоОстаток
//	|	КОНЕЦ КАК ОстатокНаСкладе,
//	|	ЕСТЬNULL(ВЫБОР		
//	|		КОГДА &ИспользоватьРезервирование
//	|			ТОГДА ВЫБОР
//	|					КОГДА ВремТаблицаДокумента.Коэффициент <> 0
//	|						ТОГДА ВРезервеОстатки.КоличествоОстаток / ВремТаблицаДокумента.Коэффициент
//	|					ИНАЧЕ ВРезервеОстатки.КоличествоОстаток
//	|				КОНЕЦ
//	|		ИНАЧЕ 0
//	|	КОНЕЦ, 0) КАК КоличествоВРезерве
//	|ИЗ
//	|	ВремТаблицаДокумента КАК ВремТаблицаДокумента
//	|
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыНаСкладах.Остатки(
//	|				,
//	|				ВЫБОР
//	|						КОГДА &ИспользуютсяОбщиеСклады
//	|							ТОГДА ИСТИНА
//	|						ИНАЧЕ Организация = &Организация
//	|					КОНЕЦ
//	|					И Склад = &Склад) КАК ТоварыНаСкладахОстатки
//	|		ПО ВремТаблицаДокумента.Номенклатура = ТоварыНаСкладахОстатки.Номенклатура
//	|			И ВремТаблицаДокумента.ХарактеристикаНоменклатуры = ТоварыНаСкладахОстатки.ХарактеристикаНоменклатуры
//	|			И ВремТаблицаДокумента.СерияНоменклатуры = ТоварыНаСкладахОстатки.СерияНоменклатуры
//	|
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(,
//	|				Склад = &Склад
//	|					И ВЫБОР
//	|						КОГДА &ИспользуютсяОбщиеСклады
//	|							ТОГДА ИСТИНА
//	|						ИНАЧЕ Организация = &Организация
//	|					КОНЕЦ) КАК ВРезервеОстатки
//	|		ПО (ВремТаблицаДокумента.Номенклатура = ВРезервеОстатки.Номенклатура)
//	|			И (ВремТаблицаДокумента.ХарактеристикаНоменклатуры = ВРезервеОстатки.ХарактеристикаНоменклатуры)
//	|			И (ВремТаблицаДокумента.СерияНоменклатуры = ВРезервеОстатки.СерияНоменклатуры)
//	|";
//	
//	Возврат ТекстЗапроса;
//	
//КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСерияНоменклатурыПриИзменении(Элемент)
	
	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры

&НаКлиенте
Процедура СкладОтправительПриИзменении(Элемент)
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.ЯчейкаОтправитель = ПолучитьЯчейку(ТекущаяСтрока.Номенклатура, Объект.СкладОтправитель);	
	КонецЦикла;	
	ЗаполнитьОстаткиПоТоварам();
	
КонецПроцедуры
//-- №11476

&НаКлиенте
Процедура ТоварыЗаказНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//++ №14768
	СтандартнаяОбработка = Ложь;
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	МассивЗаказов = ПолучитьМассивЗаказовНаПроизводствоПоНомеруРасчета(ТекущиеДанные.Номенклатура);
	
	ДанныеВыбора = Новый СписокЗначений;
	
	Для Каждого ТекущийЗаказ Из МассивЗаказов Цикл
		ДанныеВыбора.Добавить(ТекущийЗаказ);
	КонецЦикла;
	//-- №14768
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьМассивЗаказовНаПроизводствоПоНомеруРасчета(Номенклатура)
	
	Если НЕ (Справочники.ВидыНоменклатуры.ЭтоНоменклатураУникальногоПотолкаИлиОтреза(Номенклатура)
			Или Справочники.ВидыНоменклатуры.ЭтоНоменклатураПродукция(Номенклатура)) Тогда
		Возврат новый Массив;
	КонецЕсли;
		
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗаказНаПроизводство.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ЗаказНаПроизводство КАК ЗаказНаПроизводство
	|ГДЕ
	|	ЗаказНаПроизводство.ПродукцияНомерРасчета = &НомерРасчета
	|";
	Запрос.УстановитьПараметр("НомерРасчета", Номенклатура.Потолок_НомерРасчета);
	
	МассивДанных = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат МассивДанных;
	
КонецФункции

//nva+++
#Область ОбработчикиСобытийТаблицыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	ОчиститьСообщения();
	СтрокаТабличнойЧасти = Элементы.Товары.ТекущиеДанные;
	
	//#2792
	Если ИспользоватьКонтрольКратности Тогда
		СтруктураДанные = СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти);
		ОтказВИзмененииКоличества = Ложь;
		ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества);
		Если ОтказВИзмененииКоличества Тогда
			СтрокаТабличнойЧасти.Количество = 0;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Процедура ПроверитьКратностьЕдиницИзмеренияНаСервере(СтруктураДанные, ОтказВИзмененииКоличества)
	
	ОбщийМодульСервер.ПроверитьКратностьЕдиницИзмерения(ОтказВИзмененииКоличества, СтруктураДанные, Перечисления.ВидыДокументовПроверкиКратности.ПеремещениеТоваров);
	
КонецПроцедуры

#Конецобласти

&НаСервере
Функция ПолучитьЯчейку(Номенклатура, Склад)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураСкладскиеЯчейки.Ячейка КАК Ячейка
		|ИЗ
		|	Справочник.Номенклатура.СкладскиеЯчейки КАК НоменклатураСкладскиеЯчейки
		|ГДЕ
		|	НоменклатураСкладскиеЯчейки.Ссылка = &Номенклатура
		|	И НоменклатураСкладскиеЯчейки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ячейка;
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

&НаКлиенте 
Функция СтруктураДанныхПоСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				"");
	СтруктураДанные.Вставить("Валюта", 				"");
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		"");
	СтруктураДанные.Вставить("Контрагент",			"");
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	"");
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);

	Возврат СтруктураДанные;
	
КонецФункции

&НаСервере
Функция СтруктураДанныхПоСтрокеТабличнойЧастиСервер(СтрокаТабличнойЧасти, ИмяТаблицы = "Товары")
	
	СтруктураДанные = Новый Структура;
	СтруктураДанные.Вставить("ИмяТаблицы",			ИмяТаблицы);                          //#2792
	СтруктураДанные.Вставить("НомерСтроки",			СтрокаТабличнойЧасти.НомерСтроки);  //#2792
	СтруктураДанные.Вставить("Номенклатура",		СтрокаТабличнойЧасти.Номенклатура);
	СтруктураДанные.Вставить("ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры);
	СтруктураДанные.Вставить("ЕдиницаИзмерения", 	СтрокаТабличнойЧасти.ЕдиницаИзмерения);
	СтруктураДанные.Вставить("Количество", 			СтрокаТабличнойЧасти.Количество);
	СтруктураДанные.Вставить("Дата", 				Объект.Дата);
	СтруктураДанные.Вставить("ВидЦен", 				"");
	СтруктураДанные.Вставить("Валюта", 				"");
	СтруктураДанные.Вставить("Организация",			Объект.Организация);
	СтруктураДанные.Вставить("Подразделение",		"");
	СтруктураДанные.Вставить("Контрагент",			"");
	СтруктураДанные.Вставить("ДоговорКонтрагента", 	"");
	СтруктураДанные.Вставить("ИспользоватьКонтрольКратности", 	ИспользоватьКонтрольКратности);
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеНоменклатурыПриИзменении(СтруктураДанные)
	
	ОбщиеДанныеНоменклатуры = Новый Структура;
	ОбщегоНазначенияКлиентСервер.ДополнитьСтруктуру(ОбщиеДанныеНоменклатуры, СтруктураДанные);
	ОбщиеДанныеНоменклатуры = ОбщийМодульВызовСервера.ПолучитьДанныеНоменклатурыПриИзменении(ОбщиеДанныеНоменклатуры);
	
	СтруктураДанные.Вставить("СтатьяДоходов",  ОбщиеДанныеНоменклатуры.СтатьяДоходов);
	СтруктураДанные.Вставить("СтатьяРасходов", ОбщиеДанныеНоменклатуры.СтатьяРасходов);
	
	СтруктураДанные.Вставить("Цена", 0);
	
	Если ТипЗнч(СтруктураДанные.ЕдиницаИзмерения) = Тип("СправочникСсылка.КлассификаторЕдиницИзмерения") Тогда
		СтруктураДанные.Вставить("Коэффициент", 1);
	Иначе
		СтруктураДанные.Вставить("Коэффициент", ОбщийМодуль.ПолучитьКоэффициентЕдиницыИзмерения(СтруктураДанные.ЕдиницаИзмерения));
	КонецЕсли;
		
	Если СтруктураДанные.ИспользоватьКонтрольКратности 
		И НЕ ОбщийМодульСервер.НастройкаПользователя("РазрешитьНесоответствиеКратностиЕдиницИзмерения") Тогда
		
		СтруктураПоиска = Новый Структура("ВидДокумента, ЕдиницаИзмерения", Перечисления.ВидыДокументовПроверкиКратности.РеализацияТоваровИУслуг, СтруктураДанные.ЕдиницаИзмерения);
		НайденныеСтроки = СтруктураДанные.Номенклатура.Кратность.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество() > 0 Тогда		
			СтруктураДанные.Вставить("Количество", 0); //#2792
		Иначе
			СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
		КонецЕсли;
	Иначе
		СтруктураДанные.Вставить("Количество", СтруктураДанные.Количество);
	КонецЕсли;
	
	Возврат СтруктураДанные;
	
КонецФункции

&НаКлиенте
Процедура РегистрацияИзменений(Команда)
	Если Объект.Ссылка = Неопределено Тогда
		Объект.Ссылка = ЭтаФорма.Ссылка;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сообщ = Новый СообщениеПользователю;
		Сообщ.Текст = "Объект не записан, сначала запишите объект, а потом повторите текущее действие.";
		НСтр("RU = 'Объект не записан, сначала запишите объект, а потом повторите текущее действие'; de = 'Das Objekt wird nicht aufgezeichnet, das Objekt zuerst speichern und dann die aktuelle Aktion wiederholen'");
		Сообщ.Сообщить();
		Возврат;
	КонецЕсли;
		
	ФормаОтчета = ПолучитьФорму("Отчет.Лен_ХронологияИзмененияРеквизитовУправл.Форма.ФормаОтчета1");	
	Отчет1 = ФормаОтчета.Отчет;	
	Отчет1.АнализируемыйОбъект = Объект.Ссылка;	
	Отчет1.АтоматическийРежим = Истина;	
	ФормаОтчета.Открыть();     
	
	//Никифоров
	ФормаОтчета.СформироватьОтчетИзОбъекта(ФормаОтчета.Результат, ФормаОтчета.ДанныеРасшифровки);
КонецПроцедуры

&НаКлиенте
Процедура СкладПолучательПриИзменении(Элемент)
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		ТекущаяСтрока.ЯчейкаПолучатель = ПолучитьЯчейку(ТекущаяСтрока.Номенклатура, Объект.СкладПолучатель);	
	КонецЦикла;
КонецПроцедуры
//nva---
